{
	"io": true,
	"data": {
		"title": "逻辑判断大比拼",
		"info": "逻辑判断主要考察的是一个人的逻辑推理判断的能力，以下是几道逻辑判断推理题目，你不妨测测自己的逻辑判断能力。",
		"topic": [{
				"no": 1,
				"type": "EnterAnswer",
				"title": "考试成绩:“恭喜你们，”老师对进入办公室的3个学生说，“你们在这次语文、英语、物理考试中，取得了很好的成绩，并且你们3个各有一门成绩获得最高分，你们能猜出来吗?”甲想了想说:“我语文考最高分。”乙说:“丙考最高分的应该是物理。”丙说:“我考最高分的不是英语。”老师说:“其实有一门考试，你们3个人中，有两个人考的分数是一样的，并且都是最高分，而且你们刚才的猜测中只ー个人是正确的，你们能判断出各自的最高成绩是哪一门吗?”<a>",
				"info": "",
				"opt": [""],
				"score": [""]
			},
			{
				"no": 2,
				"type": "EnterAnswer",
				"title": "聪明的囚徒:古时候，有一个国王想处死一个奴隶，他为了表现自己的聪明，制定了一条规定:“奴隶可以任意说一句话，而且这句话马上能被验证真假，如果奴隶说的是真话，那么就处以绞刑;如果说的是假话，那么就砍头。”这个奴隶非常聪明。他说了一句话，结果无论国王想按照哪种方式处死他都将违背自己的决定，所以最后只得放了他。你知道这句话是什么吗?",
				"info": "",
				"opt": [""],
				"score": [""]
			},
			{
				"no": 3,
				"type": "EnterAnswer",
				"title": "孩子的年龄:两个新认识的朋友在一起聊天，乙知道甲有3个孩子，他想知道他们的年龄。甲告诉乙3个孩子的年龄的乘积是36，并且告诉他，3个孩子年龄的和就是昨天的日期。乙想了想，说还需要一些条件。甲又说，我最大的孩子可以拉小提琴了。于是乙很快就算出了孩子的年龄。请问3个孩子的年龄分别是多少?为什么?",
				"info": "",
				"opt": [""],
				"score": [""]
			},
			{
				"no": 4,
				"type": "EnterAnswer",
				"title": "小刘请吃饭小刘看上了同系的一个女生，但是他总是找不到机会和她有更深的接触，这小刘请吃饭她吃饭，但是如果贸然开口的话，可能会被她拒绝，所以他想出了一个计策。他对那个女生说:“我有两个问题要问你，它们只能回答是或者否，不能用其个计策。他的语句。还有就是，你必须郑重回答，两个答案必须在逻辑上完全合理，不能自相矛盾。”那位女生想了一下，党得挺好玩的，所以就答应了。你知道小刘该怎么问，オ能达到请女生吃饭的目的?",
				"info": "",
				"opt": [""],
				"score": [""]
			},
			{
				"no": 5,
				"type": "EnterAnswer",
				"title": "苹果的颜色:晚会上，老师要和同学做一个游戏，他拿出3个苹果，其中两个是绿色的，一个是红色的。他叫了甲乙两名同学，让他们青靠背站立，然后分别给两个人每人一个苹果。看谁可以先猜着对方手中苹果的颜色。在发完苹果后，两个人先都没有说话，然后乙说:“我知道了，甲手里拿的苹果是绿色的。”你知道甲是怎么测出来的呢？",
				"info": "",
				"opt": [""],
				"score": [""]
			},
			{
				"no": 6,
				"type": "EnterAnswer",
				"title": "生儿生女:有一个大家庭，父母共养有A、B、C、D、E、F、G7个子女，这7个孩的情况是这样的:(1)A有3个妹妹。(2)B有一个哥哥。(3)C是老三，她有两个妹妹。 (4)D有两个弟弟(5)E管前面两个叫姐姐。(6)F有个弟弟。从以上的情况，你知道这7个孩子中哪几个是女孩，哪几个是男核吗?",
				"info": "",
				"opt": [""],
				"score": [""]
			},
			{
				"no": 7,
				"type": "EnterAnswer",
				"title": "与会者有人:邀请A、B、C、D、E、F6个人参加ー项会议，这6个人有些奇怪，因为他们有很多要求，已知:(1)A、B两人至少有一人参加会议。(2)A、E、F三人中有两人参加会议。(3)B和C两人一致决定，要么两人都去，要么两人都不去。(4)A、D两人中只有一人参加会议(S)C、D两人中也只有一人参加会议(6)如果D不去，那么E也决定不去。那么最后究竟有哪几个人参加了会议呢?",
				"info": "",
				"opt": [""],
				"score": [""]
			},
			{
				"no": 8,
				"type": "EnterAnswer",
				"title": "常胜将军:阿贝、本、卡尔和唐这4人玩一种游戏，这种游戏的基本玩法是轮流从一堆码中取走筹码。其中有人每盘都赢。(1)这4个人一共玩了50盘，每盘游戏开始时那堆筹码中的筹码数目都是偶数:第一盘开始时是2枚筹码，第二盘开始时是4枚筹码，以此类推，到第50盆始时是100枚筹码(2)在整个50盘游戏中，各人每次所取筹码的数目保持不变:要么一直取1枚码，要么一直取2枚筹码。如果取到最后只剩下1枚筹码，而轮到取的那个人取2枚筹码的，他就“弃权，让给下一个人取。(3)在各盘游戏中，取筹码的顺序也总是保持不变:首先是阿贝，其次是本，次是卡尔，最后是唐。(4)在每一盘游戏中，规定谁取走最后一枚筹码谁赢。这4个人中谁每盘都京?脸上的煤灰在一辆长途客车中，靠窗有两名乘客，这时一阵风吹来，刮过来一些煤，把一个人的脸弄脏了，另一个人脸上仍是干净的。那么，他们两个人谁会去洗脸?3)在各盘游戏中，取筹码的顺序也总是保持不变:首先是阿贝，其次是本，次是卡尔，最后是唐。4)在每一盘游戏中，规定谁取走最后一枚筹码谁赢。这4个人中谁每盘都赢?",
				"info": "",
				"opt": [""],
				"score": [""]
			},
			{
				"no": 9,
				"type": "EnterAnswer",
				"title": "脸上的煤灰:在一辆长途客车中，靠窗有两名乘客，这时一阵风吹来，刮过来一些煤把一个人的脸弄脏了，另一个人脸上仍是干净的。那么，他们两个人谁会洗脸？",
				"info": "",
				"opt": [""],
				"score": [""]
			},
			{
				"no": 10,
				"type": "EnterAnswer",
				"title": "神仙和妖怪:一个人去寻找神仙解惑，经历艰辛，他按要求找到了3个人，他知道这3个人可能是神仙也可能是妖怪，但是他知道神仙是说真话的，妖怪是说假话的。",
				"info": "",
				"opt": [""],
				"score": [""]
			}
		],
		"report": {
			"abbr": "score",
			"scoreAnswer": ["1.答案:甲和乙都考了物理的最高分，丙考了语文的最高分。", "2.答案:这名奴隶说:“我是将要被砍头的。”如果国王认为这句话是真话，那么这名奴隶将要被处以绞刑，这样，这句话就成了假话，所以他只能被砍头。但如果被砍头，这句话又变成了真话，所以这名奴隶既不能被处以绞刑也不能被砍头，国王只能放了他。", "3:答案:第一步，3个孩子的年龄的乘积是36，表明他们的年龄组合可能是(1,2,18),(1,6,6)(1,3,12)(2,2,9),(3,3,4),(2,3,6)第二步，甲说3个孩子年龄的和是一个数字。我们不知道是什么数字，但我们可以看出这个数字并不能让乙判断每个孩子的年龄，所以这个数字在判断中是有重复的。我们在第一步的基础上相加各组数字，发现他们的和分别是21、13、16、13、10、11。由此可以判断孩子的年龄组合可能是(1，6、6)和(2，2，9)。第三步，甲说最大的孩子可以拉小提琴了，这说明最大的孩子是一个，所以可以判断3个孩子的年龄分别是2、2、9。", "4.答案他的第一个问题是:“今晚你愿意和我一起去吃饭吗?”他的第二向题是:“对这个问题的回答，与对第一个的回答是一样的吗?”这样，这位女生如果对第一个问题说否，那么对于第二个问题，她无论说是还是否，都在逻辑上是自相矛盾的。所以，她对第一个问题只能回答“是”。", "5.答案:如果两个人有一个人拿了红苹果，在发完苹果后他就可以很快说出对方拿的是绿苹果。但是开始没有人说话，所以两个人拿的都是绿苹果，所以，乙可以说出甲拿的是绿苹果。女(S)E女", "6.答案:从大到小:(1)A男(2)B男(3)C女(4)D女(5)E女(6)F女(7)G男", "7.答案:A、B、C、F参加了会议", "8.答案:根据（2），把这4个人从一堆筹码中所取筹码的枚数组合起来一共有16可能。根据(1)，设先是2枚筹码一堆，然后4枚筹码一堆，再后6枚筹码、8枚筹码、10枚筹码。运用(3)和(4)，记下每一种组合在各种枚数下的赢家。如果出现了不同的高家，就不必再记下去。注意其中第9种组合:1，2，2，1。只有这种组合在每一盘游戏中都导致了同一个赢家一一唐。不但如此，对于其他的偶数枚筹码的情况，在这种组合下，唐也总是赢家。", "9.答案:脸上干净的人。因为他看到对方的脸上脏了，以为自己险上也有煤灰，就会去洗脸;而脸上有煤灰的人看到对方的脸上是干净的，以为自己的脸上地是干净的，所以他不会去洗脸。", "10.答案：有2个是神仙。"]
		}
	}
}